app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Calculus"], ["room_number", 22]]
---
    def create
        @school_class = SchoolClass.new(post_params(:title, :room_number))
        @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ? WHERE "school_classes"."id" = ?  [["room_number", 25], ["id", 2]]
---
    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(post_params(:title, :room_number))