app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Victor"], ["last_name", "Salazar"], ["created_at", "2020-06-24 05:57:32.694677"], ["updated_at", "2020-06-24 05:57:32.694677"]]
---
    def create
        @student = Student.new(post_params(:first_name, :last_name))
        @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Vic"], ["updated_at", "2020-06-24 05:57:49.748328"], ["id", 4]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(post_params(:first_name, :last_name))